/*Фирма имеет несколько пунктов приема вторсырья. 
Каждый пункт получает деньги для их выдачи сдатчикам вторсырья. 
Сведения о получении денег на пунктах приема записываются в таблицу:
Income_o(point, date, inc)
Первичным ключом является (point, date). 
При этом в столбец date записывается только дата (без времени), т.е. прием денег (inc) на каждом пункте производится не чаще одного раза в день. 
Сведения о выдаче денег сдатчикам вторсырья записываются в таблицу:
Outcome_o(point, date, out)
В этой таблице также первичный ключ (point, date) гарантирует отчетность каждого пункта о выданных деньгах (out) не чаще одного раза в день.
В случае, когда приход и расход денег может фиксироваться несколько раз в день, используется другая схема с таблицами, имеющими первичный ключ code:
Income(code, point, date, inc)
Outcome(code, point, date, out)
Здесь также значения столбца date не содержат времени.
*/

-- Задача № 81 2* - Из таблицы Outcome получить все записи за тот месяц (месяцы), с учетом года, в котором суммарное значение расхода (out) было максимальным. 

-- Вариант 1
select * 
from outcome o
where exists (
		select * 
		from (
				select top(1) with ties month(date) as n_month, year(date) as year, sum(out) as out
				from outcome
				group by month(date), year(date)
				order by out desc
				) x
		where n_month = month(o.date) 
			and year = year(o.date)
		)
